{
"help": {
	"rec": {
		"description":"**rec** - The rec command allows users to request recommendations for various activities.",
		"qualifiers":"\t\tQualifiers: anime, game",
		"example":"\t\tExample: !tk rec anime"
		}
	},
	
"rec": {
	"anime":[
		"**A Silent Voice** - A deaf elementary school girl, Shouko Nishimiya, upon transferring, meets a boy named Shouya Ishida in her new class. Shouya, who is not deaf, leads the class in bullying Shouko, because she is deaf. As the bullying continues, the class starts to bully Shouya for bullying Shouko. After graduating from elementary school, Shouko and Shouya do not speak to each other… until later, when Shouya, tormented over his past, decides he must see Shouko once more. Shouya wants to make amends for what he did in elementary school and be Shouko's friend.",
		"**Akira** - Following the disaster wrought upon the world by a mysterious being called ‘Akira’, Neo Tokyo is now in social and economic turmoil. In such a decaying city, feisty Kaneda and his shy friend Tetsuo survive by running around in a biker gang, chasing local rivals and generally evading the police. Everything changes, however, when Tetsuo crashes into a strange-looking boy during a bike chase and the military ends up taking him away. When he eventually returns to his friends, he’s no longer the same weak little boy they always knew – in fact, a military experiment has turned him into something beyond human imagination. While the military is intent on reclaiming its specimen at any cost, Tetsuo is sick of being bullied around and is about to show everyone, including his friend Kaneda, exactly who is boss.",
		"**Attack on Titan** - Over a century ago, mankind was devoured by giant beings of unknown intelligence and origin known as Titans – creatures that eat humans alive indiscriminately and for no apparent reason. The remaining population has managed to survive the last hundred years only by building a multi-walled city capable of keeping the Titans at bay, training military recruits to patrol the perimeter and gather intelligence about their mysterious foe. Eren and Mikasa have lived a relatively peaceful life behind the city's walls, but when a massive Titan appears, smashing the outer barrier and unleashing a wave of terror, their lives are brutally changed forever...",
		"**Azumanga Daioh** - Ten-year-old genius Chiyo, animal-loving Sakaki, loudmouth Tomo, athletic Kagura, weight-conscious Yomi and dim-witted Osaka are six friends who share laughs, good times, and a high school homeroom. With scary (and sometimes perverted) teachers, school festivals, penguin suits and general hilarity abounding, you can be sure that there's never a dull day in the life of one of these students!",
		"**Black Lagoon** - Rokuro Okajima is a small-time salaryman who is carrying documents for his company, when the ship he's traveling on is attacked by pirates. Kidnapped, he discovers to his dismay that his employers' main concern is to ensure the documents don't get into the wrong hands, even if it means sending the carrier to the bottom of the sea. Now, with his former life ruined and his kidnappers seeming comparatively friendly, \"Rock\" decides to join their merry band of mercenaries, and sets out with a new career to the shadier corners of the South China Sea.",
		"**Chihayafuru** - Chihaya Ayase is a famous beauty at her school, but she’s far from a conventional girl. Three years ago in her final year of elementary school, Chihaya and her friend Taichi became infatuated with the card game, Karuta, after connecting with a lonely boy named Arata Wataya. But when the trio graduated from elementary school, they each went their separate ways but shared one common goal: to excel in the game and meet each other at the national championships. Now, Chihaya is attempting to share her passion for the game by creating a competitive Karuta club at school, but when she reunites with Taichi it seems that maybe she’s the only one with the intention of fulfilling their childhood promise...",
		"**Code Geass** - In 2010, the Britannian Empire enslaved Japan using powerful mecha known as Knightmares; in the aftermath Japan was renamed Area 11, and its people began a hard and terrible existence. Lelouch, a Britannian student living in Area 11, has grown up hating the Empire and everything it stands for. One day, in the middle of a terrorist attack, Lelouch meets a mysterious girl who grants him the ability to control minds. Can he use his new power to fight for freedom, or will his hatred twist his good intentions into mindless acts of vengeance?",
		"**Erased** - Satoru Fujinuma is a reclusive part-timer with no plans for the future. What sets him apart from the other slackers in his town is an involuntary time travel ability that allows him to jump back several seconds in time in order to prevent accidents and even deaths. As incidents around town begin reminding Satoru of a childhood trauma he'd sooner forget, he finally begins to question what caused his ability to surface and whether or not it's powerful enough to change the past.",
		"**Grave of the Fireflies** - With their father serving overseas in the Navy towards the end of the World War 2, Seita and his younger sister Setsuko are living as normally as they can. One day during a firebomb raid on the city their mother suffers fatal wounds and the two siblings' lives are turned upside down as they go to live with a relative. After suffering the cruel treatment of their aunt, who makes it clear that their very presence is a nuisance, Seita and Setsuko decide to leave and go to live in an abandoned bomb shelter. With no one else to rely on, Seita and Setsuko try their hardest to live from day to day. Though when food becomes ever more scarce and no one is willing to sell what little provisions they have, life for the pair is increasingly difficult. Then when Setsuko falls ill, Seita begins to realize just how fragile life is...",
		"**Howl's Moving Castle** - The responsible Sophie led a relatively normal life, safe within the walls of the hat shop in which she works; for outside, it is rumored, the evil wizard Howl roams the land in his mobile black castle. After a chance and mystical encounter, poor Sophie finds herself transformed by a spell which makes her appear to be an old woman, and thus embarks on an adventure to find Howl’s castle and put an end to her curse. A mystical world of talking flames, sentient scarecrows and magic aplenty awaits those who seek the legendary Howl...",
		"**JoJo's Bizarre Adventure** - When Jonathan Joestar was just a baby, his mother tragically died in a carriage accident, and his father George was saved by the kindness of a stranger, Dario Brando. At least, that's what George believed, unbeknownst to him that Dario was just attempting to steal from the victims. Thus, when Dario later dies and his son, Dio, comes to his doorstep, the wealthy George eagerly adopts the boy. But what should have become a budding friendship between two siblings quickly becomes a nightmare for poor Jonathan, as Dio is cruel, calculating and will go to great lengths to become George's primary heir. Little does Jonathan know that this unfortunate childhood is only the harbinger of things to come...",
		"**Kill La Kill** - Ryuuko Matoi is a fiery, feisty girl on a vengeful mission: she’ll find her father’s murderer at all costs, with only a giant red scissor blade as a clue to the villain’s whereabouts. Using the item as a weapon, she fights her way into the terrifying Honnouji Academy to track down a lead, unaware that the institute is brutally governed by a student council that’s anything but ordinary. Wielding special “Goku uniforms”, the group, led by president Satsuki, uses superpowers to keep the student body in check - but things are about to change now that Ryuuko’s in town!",
		"**Kiss Him, Not Me** - Kae Serinuma is what you'd call a \"fujoshi.\" When she sees boys getting along with each other, she loves to indulge in wild fantasies! One day her favorite anime character dies and the shock causes her to lose a ton of weight. Then four hot guys at school ask her out, but that isn't exciting to her at all — she'd rather see them date each other!",
		"**Legend of the Galactic Heroes** - The war between the monarchical Galactic Empire and the democratic Free Planets Alliance has raged ceaselessly across the galaxy for over a century, with the fleets of both powers having fought countless battles. Currently the conflict revolves around the strategic Iserlohn Corridor, one of only two passages of space through which the two forces can access each other. Here the Empire has built the nigh-impregnable Iserlohn Fortress, whose deadly weaponry has thwarted repeated efforts by the Alliance to capture her. Phezzan, a neutral mercantile state, controls the other corridor. The long war has resulted in an indecisive stalemate, but there are two men from the two worlds who will change everything: Wen-Li Yang, a gifted strategist from the Alliance who wants nothing more than to retire and be a historian; and Reinhard von Lohengramm, a man from the Empire whose ambition knows no bounds. Their loves, struggles, triumphs and failures play across an interstellar stage of intrigue, war and death.",
		"**Miss Kobayashi's Dragon Maid** - Miss Kobayashi is your average office worker who lives a boring life, alone in her small apartment–until she saves the life of a female dragon in distress. The dragon, named Tohru, has the ability to magically transform into an adorable human girl (albeit with horns and a long tail!), who will do anything to pay off her debt of gratitude, whether Miss Kobayashi likes it or not. With a very persistent and amorous dragon as a roommate, nothing comes easy, and Miss Kobayashi's normal life is about to go off the deep end!",
		"**Mushishi** - It isn't unusual for a person to feel that the world around them is strange and has unexpected secrets lying just beyond their sight. However, for most people this is just an occasional sensation that greets them upon awakening or chases them into sleep. For the mushi researcher Ginko, it isn't a feeling at all; it is a knowledge which guides his travels and motivates his life. Found in the cracks between what is conceivable and what is not, are the varied life forms collectively known as mushi. They surround us and affect us, but their intensely different nature makes them unrecognizable to most. Ginko brings these life forms into perspective for the lives of those most affected and most in need of an explanation.",
		"**Nichijou** - Yuuko, Mio and Mai are regular high school girls who lead a normal everyday life. However, with bizarre explosions causing random objects to rain down on their heads, lunch turning into an epic battle between girl and wiener, and students riding to school on goats, their lives are anything but ordinary. Meanwhile android Nano spends her days wishing she were a normal human, but keeping house for her creator, the playful and immature child genius Hakase, dealing with talking cat Sakamoto, and trying to keep a hold of her multitude of easily-detachable body parts, her dream is far from a reality...",
		"**No Game, No Life** - An urban legend states that those exceptionally gifted at gaming will be sent a special game invitation, and the winners of the challenge will be whisked away to another world. When Sora and Shiro, two hikikomori NEETs who happen to be both siblings and notorious gamers, receive this invitation, they defeat it with ease. And like the legends tell, they're transported to another world where conflicts, peoples' lives and even country borders are decided by competitions and games. Always up for a challenge, the pair quickly take on the obstacles that come their way, whether it be restoring lowly humanity's good name compared with the other races or helping influence who will become the next king.",
		"**Parasyte -the maxim-** - In secret, alien parasites drift downwards toward Earth. Their directive: to take control of a human body and thrive in secret. When a parasite attempts to take over Shinji, an ordinary high school student, he stops it in his arm to save his mind. With the strange power of amorphous muscle, the curious parasite strikes an uneasy truce with Shinji: it will keep him alive and strong so that it may continue living, and will help protect him from the other parasites that might not take kindly to Shinji's mind still actively working. Can Shinji gain the courage to face the parasites and protect humanity? And would it even make a difference if he did?",
		"**Perfect Blue** - When popular pop idol Mima decided to retire from her group, Cham, and become an actress, she had no idea that one person's obsession would soon spiral out of control. With death threats, letter bombs and a forged website which details her every move, Mima finds herself slowly becoming trapped in a nightmare she can't seem to escape. With murders piling up and her mental state slowly degrading, can she discover who the culprit is, before she becomes the next victim?",
		"**Princess Mononoke** - With the rise of the Iron Age in feudal Japan, man and nature grow increasingly at odds. As mankind infringes more and more into the kingdom of the beasts, many of the elder animal gods begin to succumb to their rage, cursing themselves as they lash out at rural and urban settlements alike. When a young Ashitaka, hero of his village, is imparted with one of these curses after slaying a crazed god, he forces himself into exile to prevent further harm to his village. As he ventures out into the world, however, he discovers just how dire the straights have become - with man and beast ready to break into all out war, his curse becomes the least of his problems. As both sides teeter dangerously on the side of outright slaughter of one another, Ashitaka sets his own problems aside and, using his charisma and honor, seeks to quell the hatred before it gets beyond repair - but will he be in time or is he simply delaying the inevitable?",
		"**Read or Die** - Secret agent for the British Libraries, Yomiko Readman, has an infatuation with books. When she purchases one of the books that contain the notes for a plan to purge the world of humanity, Yomiko (along with the help of Ms. Deep and Drake) uses her powers of paper manipulation to stop a group of resurrected men from fulfilling the plan.",
		"**Recovery of an MMO Junkie** - Morioka Moriko (♀) is 30, single, and a NEET. She has dropped out of the real world. Searching for a safe place, the place she ended up... is the online world!! In this online game, Moriko starts a new life as a handsome young man with silky hair named Hayashi. However, she’s an obvious noob and ends up dying numerous times when a lovely girl named “Lily” lends her a helping hand. Meanwhile IRL, she ends up having a shocking encounter with a mysterious handsome salaryman named Sakurai Yuta. After meeting him, the real world starts to change and starts affecting her online world as well?!",
		"**ReLIFE** - Arata Kaizaki (27) quit the job he landed after graduation in only three months. His life did not go well after that. Now his parents are threatening to stop sending money, and want him to come back to the country. He has no friend or girlfriend to share his troubles with...as he hits rock bottom a strange man named Ryo Yoake appears. Yoake invites Kaizaki to join a societal rehabilitation program for NEETs called ReLife. This program uses a mysterious drug to make him look younger, and sends him back to high school for a year...",
		"**Shirobako** - Aoi will never forget how she felt the day her high school animation club’s labor of love was shown at the cultural festival. The sense of awe and the feeling of accomplishment that came with completing their very first project are exactly what encouraged Aoi and her club mates to enter the animation industry in the first place. But two years later Aoi has graduated, and now that she works as a production assistant for a big-name animation studio, the daunting reality of her job has somewhat diminished her enthusiasm. Despite the long hours and the punishing schedule, Aoi still hopes to fulfill the promise she and her club friends Ema, Shizuka, Misa, and Midori made: to one day reunite and make a real animated feature of their own as professionals!",
		"**Shouwa Genroku Rakugo Shinjuu** - When a small-time crook is released from prison, he is determined to turn his life around by apprenticing himself to the great rakugo master Yakumo VIII, inspired by his performance of \"Shinigami\" during his incarceration. Surprisingly, the old man agrees to train him and brings his new apprentice to his own house to live, giving him the name \"Yotaro\", a classical word used in rakugo meaning \"fool\". Yakumo has much to teach about the art of rakugo, but both he and his ward Konatsu- a hot-headed young woman whose father was also a famous storyteller- are difficult people with a shared dark past. Yakumo refuses to train her, claiming that the world of rakugo is no place for women, and Konatsu has vowed to kill him, claiming that Yakumo murdered her father!",
		"**Spirited Away** - Chihiro and her family are on their way to their new home, when they discover an abandoned amusement park. After Chihiro's family mysteriously turn into pigs, she is thrown into a surreal world of magic and fantasy. Join her as she struggles to survive in the bathhouse of the gods, ruled by an evil witch who has stolen not only her name, but her way back to the real world.",
		"**Steins;Gate** - The eccentric mad scientist Okabe, his childhood friend Mayuri, and the otaku hacker Daru have banded together to form the Future Gadget Research Laboratory, and spend their days in a ramshackle laboratory hanging out and occasionally attempting to invent incredible, yet generally useless, futuristic gadgets. However, their claymore is a hydrator and their hair dryer flips breakers, and the only invention that’s even remotely interesting is their Phone Microwave, which transforms bananas into oozing green gel. But when an experiment goes awry the gang discovers that the Phone Microwave can also send text messages to the past. And what's more, the words they send can affect the flow of time and have unforeseen, far-reaching consequences...",
		"**Summer Wars** - In the future, all facets of society are tied into OZ, a virtual world inhabited by millions of users. Kenji, one of OZ’s moderators, was set to begin another typical summer when the lovely Natsuki asked him to accompany her to her hometown as a job. However, little did Kenji know that the 'job' entailed pretending to be Natsuki’s fiancé in front of her eccentric family! Now on display and feeling like a fish out of water, Kenji tries his best to fit in with Natsuki and her relatives, until one day he receives a mysterious math problem through a text message. As an avid math fanatic Kenji can’t help but try to solve it, unaware that his actions may jeopardize not only OZ, but also the entire world...",
		"**Tokyo Godfathers** - On a chilly December evening, Hana, a transvestite, Misaki, a teenage runaway, and Gin, a retired bike racer, found little Kiyoko in the trash. For three homeless people, finding an abandoned baby might not have been the best of luck, but with good intentions and two cents to chip in, the trio set out to find the parents of the child. But locating the mother will not be an easy task, and all they have to go on is a small key...",
		"**Tokyo Magnitude 8.0** - It struck without warning one fateful day in Tokyo – a massive 8.0 earthquake rocked the city and caused massive devastation and death in its wake. Having taken her little brother to an exhibit that day, young Mirai and he find themselves alone and with no one to turn to – until a kind delivery woman named Mari promises to help them get back to their family. Now, the three travel the ruined cityscape and brave immense danger as they try their best to make their way home.",
		"**Welcome to the NHK!** - Tatsuhiro Sato is a university dropout and a \"hikikomori\" – a person suffering from social withdrawal. To Sato’s dismay, his self-imposed exile from the world is rudely interrupted when a mysterious girl knocks on his door. She has charged herself with the task of curing Sato of his hikikimori ways! Now, as new problems ranging from hentai games to internet suicide spring up, can Sato manage to overcome his hermit-like ways, or will the imaginary N.H.K conspiracy force him to remain a hikikomori forever?",
		"**Whisper of the Heart** - Whisper of the Heart is a touching Ghibli slice-of-life story, about a young girl named Shizuku. While riding the train, she notices a fat cat riding alongside her. Following the cat, she finds a shop where she is told an enchanting story of a gold statue named \"The Baron\". WotH follows Shizuku in her struggles to grow, and her budding love with the shopkeeper's son.",
		"**Yojouhan Shinwa Taikei** - A man is miserable. Despite all his dreams of a “Rose-Colored Campus Life” filled with raven-haired maidens who dote on him, his social life is going nowhere. He has no girlfriend, his only good friend keeps getting him into trouble, and the circle he joined brings him no joy. So he tries again, and again, reliving his first two years of college life ad nauseum, making different decisions each time, having no recollection that he’s already done this all before. Will the man ever be satisfied with how his life turns out?",
		"**Your lie in April** - Kousei Arima was a genius pianist until his mother's sudden death took away his ability to play. Each day was dull for Kousei. But, then he meets a violinist named Kaori Miyazono who has an eccentric playing style. His monotonus life was about to change forever.",
		"**Your Name** - Mitsuha and Taki are two total strangers living completely different lives. But when Mitsuha makes a wish to leave her mountain town and for the bustling city of Tokyo, they become connected in a bizarre way. She dreams she is a boy living in Tokyo while Taki dreams he is a girl from a rural town he’s never been to. What does their newfound connection mean? And how will it bring them together?",
		"**Yuri!!! on Ice** - Yuuri Katsuki carried the hope of all Japan on his shoulders in the Figure Skating Grand Prix, but suffered a crushing defeat in the finals. He returned to his hometown in Kyushu and hid away in his family's home, half wanting to continue skating and half wanting to retire. That was when the five-time consecutive world champion, Viktor Nikiforov, suddenly showed up with his teammate, Yuuri Plisetsky, a young skater starting to surpass his seniors. And so the two Yuuris and the Russian champion Viktor set out to compete in a Grand Prix like none the world has ever seen!"
		],
	"game":[
		"**100% Orange Juice** - AKA 100% Skill Juice; Great game to play if you hate yourself and your friends. Believe in RNGesus in the hopes that he will bestow upon you his blessing.",
		"**Cook, Serve, Delicious!** - Cooking + Typing = 100+ hours of fun. Don't be a filthy casual, be a CSD god!",
		"**Crusader Kings II** - My two wives had sex together behind my back. My gay son refused to have children and the kingdom collapsed without an heir. My wife convinced my entire council that I was mentally deranged and had me imprisoned. 10/10",
		"**Darkest Dungeon** - Best roguelike dungeon crawler around... until your super geared, super leveled party dies to RNG, but we don't talk about that.",
		"**Dishonored** - You can beat the game without being seen and without killing anyone. How many games let you do that?!",
		"**Doki Doki Literature Club** - I'm not Oki-Doki after playing Doki-Doki...",
		"**Dragon Age** - You are a Grey Warden, one of the last of a legendary order of guardians. With the return of an ancient foe and the kingdom engulfed in civil war, you have been chosen by fate to unite the shattered lands and slay the archdemon once and for all.",
		"**Elder Scrolls V: Skyrim** - Bethesda's widest and most shallow Elder Scroll game is still a lot of fun. Until you take an arrow to the knee.",
		"**Fable** - An RPG where you can fart on someone in one moment and have unprotected sex with them in the next. It's basically real life!",
		"**Fallout 4** - Mechanically, Fallout 4 is superior to all others. The storytelling can use some work, but it's still good enough to waste dozens of hours wandering around the wasteland.",
		"**Fallout: New Vegas** - AKA the best Fallout game ever created; it's wacky, it's deep, and it lets you play as a bumbling idiot who can barely formulate basic sentences.",
		"**Heroes of Might and Magic II** - Turn-based strategy game made in the 90s and still solid to this day. The campaign is impossible to beat. Prove me wrong, I dare you.",
		"**Kingdom Come: Deliverance** - With the bugginess of a Bethesda game and the depth of Crusader Kings II, what more could you want out of a supremely realistic medieval peasant simulator?",
		"**Life is Strange** - Teenage angst and time travel. It's a match made in heaven. Also, if you don't love Chloe, you're a monster.",
		"**LISA** - AKA Drugs, sex, and rock 'n roll the game.",
		"**Mass Effect** - AKA best science fiction RPG ever made; Liara is best waifu. Don't talk about the ending.",
		"**South Park: The Stick of Truth** - South Park + Lord of the Rings + Nazi Zombies + Nazi Fetus Zombies + Taco Bell + ...",
		"**Stardew Valley** - This is Harvest Moon but better.",
		"**Star Wars: Knights of the Old Republic** - AKA best game ever made; there is no Thelann without KOTOR. See: <https://tinyurl.com/y7vkqq54>",
		"**The Walking Dead: Season 1** - I'm not crying. *You're* crying.",
		"**The Wolf Among Us** - What if fairy tales were real? What if the characters lived in New York? What if you played this and found out?",
		"**To the Moon** - I'm not crying. *You're* crying.",
		"**World of Warcraft** - Don't actually play this unless you hate yourself."
		],
	"book":[
		]
	}
}